Student-DB Extension: Extend the university data frame by adding single lines of code according to the comments below!

In [1]:
#PANDAS Data Frames
import pandas as pd

In [10]:
list_2dim = [[100112,"Jim Collins","WI7",4],[120095,"Martin Schrader","WI3",7],[180331,"Achim Zahn","WI7",1],[180332,"Mark Maier","OM3",1]]

#Start with the provided 2dim-list and create a data frame 
df = pd.DataFrame(list_2dim)

#Rename the column which stores the information about field of study
df = df.rename(columns={2: 'Field of Study'})

#Rename all indices to ['ID-1', 'ID-2', 'ID-3', 'ID-4']
df.index = ['ID-1', 'ID-2', 'ID-3', 'ID-4']

#Print only column names to check 
print(df.columns)

#Print only index names to check 
print(df.index)

Index([0, 1, 'Field of Study', 3], dtype='object')
Index(['ID-1', 'ID-2', 'ID-3', 'ID-4'], dtype='object')

In [11]:
df

           0                1 Field of Study  3
ID-1  100112      Jim Collins            WI7  4
ID-2  120095  Martin Schrader            WI3  7
ID-3  180331       Achim Zahn            WI7  1
ID-4  180332       Mark Maier            OM3  1

In [14]:
#Select all rows, but only last two columns without using column or index names
df.iloc[:, df.columns.size-2:df.columns.size]

     Field of Study  3
ID-1            WI7  4
ID-2            WI3  7
ID-3            WI7  1
ID-4            OM3  1

In [15]:
#Select first and second attribute from first and second row, without using column or index names
df.iloc[0:2, 0:2]

           0                1
ID-1  100112      Jim Collins
ID-2  120095  Martin Schrader

In [ ]:
#Combine positional and label-based indexing to select Name and Semesters of the students in the last two rows
df.iloc[2: 4, df.columns.get_indexer([1,3])]

               1  3
ID-3  Achim Zahn  1
ID-4  Mark Maier  1